{"keras_version": "1.0.7", "config": [{"config": {"W_constraint": null, "name": "convolution2d_1", "activation": "linear", "b_constraint": null, "activity_regularizer": null, "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "bias": true, "input_dtype": "float32", "batch_input_shape": [null, 3, 50, 50], "nb_filter": 64, "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "nb_row": 3, "nb_col": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "dim_ordering": "th", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"W_constraint": null, "name": "convolution2d_2", "activation": "linear", "b_constraint": null, "activity_regularizer": null, "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_filter": 64, "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "nb_row": 3, "nb_col": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "dim_ordering": "th", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"W_constraint": null, "name": "convolution2d_3", "activation": "linear", "b_constraint": null, "activity_regularizer": null, "dim_ordering": "th", "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_filter": 128, "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "nb_row": 3, "nb_col": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_3", "pool_size": [2, 2], "trainable": true, "dim_ordering": "th", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "dense_1", "output_dim": 64, "input_dim": null, "trainable": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "activation": "linear", "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "dense_2", "output_dim": 10, "input_dim": null, "trainable": true, "W_regularizer": null, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_5"}, "class_name": "Activation"}], "class_name": "Sequential"}